13/data/attachments/4c680caf724e9bc3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michelle_onto_Friend_94950_2</nif:username>
            <nif:friendToBeRequested>soap_friends_a60f3bfe-14c3-416c-bec0-18aa7960c8ea</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>